{
  "title": "Web App Security",
  "img": "/Assets/CyberSecurity/WebApp.svg",
  "list3": [
    {
      "desc": "We host comprehensive, adaptive protection of web applications in any environment ensuring application availability and security across."
    },
    {
      "desc": "Research by experts at Trendsoft states that 90% of applications carry medium-to-high-risk security flaws. That’s barely surprising most of the companies built in-house unlike the operations systems, databases, and application software typically used on corporate networks- web applications from little to no time experience. This enables attackers to copy your information in the database through mistakes or omissions made in the course of developing and deploying applications."
    },
    {
      "desc": "Here Trendsoft technologies ensure Web application security tests involve detailed analysis of an application's design, networking, operating system, external data sources, data warehousing, authorization mechanisms, and authentication components. We perform an analysis black box (perspective of an outside trespasser) and white box (analysis of the source code itself). If you are already a sufferer of a web attack detected oddity in your applications, we can offer incident response services to verify the problem in all possible cases providing detailed recommendations for fixing the issue by our experts."
    }
  ],

  "list": [
    {
      "title": "Principal Global services",
      "list1": [
        {
          "desc": "Global service"
        },
        {
          "desc": "Security experts"
        },
        {
          "desc": "Incorporate Management"
        }
      ]
    },

    {
      "title": "Unequalled Protection",
      "list1": [
        {
          "desc": "OWASP Top-10 coverage"
        },
        {
          "desc": "Advanced attack protection"
        },
        {
          "desc": "Zero-day attack protection"
        },
        {
          "desc": "Negative and positive security methods"
        }
      ]
    },

    {
      "title": "Consolidated Solutions",
      "list1": [
        {
          "desc": "Web Application Firewall"
        },
        {
          "desc": "Bot Management"
        },
        {
          "desc": "API Security"
        },
        {
          "desc": "L7 DDOS Mitigation"
        }
      ],
      "list2": [
        {
          "desc": "Trendsoft Technologies web application security is all about keeping businesses up and running time keeping your number of potential risks as low as possible. Taking a multi-layered approach to application security, we blend your apps to stay secure while offering utmost user-friendly experiences."
        },
        {
          "desc": "You can tap into API security with automatic security testing and seamless integration with leading tools. Advanced bot protection is implemented for any forward-thinking companies experimenting with AI and machine learning. We even offer web application firewalls to constantly protect your system with an extra layer of defense."
        }
      ]
    },

    {
      "title": "Trendsoft Web Application firewall can secure:",
      "list1": [
        {
          "desc": "Active and legacy applications"
        },
        {
          "desc": "Third-part applications"
        },
        {
          "desc": "APIs and Microservices"
        },
        {
          "desc": "Cloud applications, containers, VMS and more"
        }
      ]
    }
  ]
}
