{
  "title": "Web Accessibility",
  "desc": "With web accessibility service Trendsoft ensures that your web content is accessible for every user. Our practice of making websites usable for all users including those with disabilities, impairments, and limitations. We make sure that people who experience difficulties or limitations have the same or similar experience as those who do not. We deliver your website – and its content – more user-friendly and easier to understand for all visitors.",
  "list": [
    {
      "title": "SECTION 508 TESTING SOLUTIONS",

      "list2": [
        {
          "desc": "Expert guidance to make your website or product Section 508 compliant and create detailed Voluntary Product Accessibility Templates (VPAT)."
        },
        {
          "desc": "Section 508 standard of the Rehabilitation Act 1973 requires all electronic and information technology developed, procured, maintained, or used by the federal government to be accessible to people with disabilities. The Section 508 Standards apply to electronic and information technology procured by the federal government, including computer hardware and software, websites, multimedia such as video, phone systems, and copiers."
        },
        {
          "desc": "Section 508 compliance does not apply to federal agencies alone but also to private companies, financial industries, healthcare, legal, or any other organization that does business with a federal agency."
        },
        {
          "desc": "TRENDSOFT TECHNOLOGIES PVT LTD. Section 508 Testing solutions, assist your organization to ensure that your websites, products, and services are fully Section 508 compliant. With a proper evaluation of your accessibility needs, our team works with you closely to chart a path to make your website or product Section 508 compliant."
        },
        {
          "desc": "We go beyond automated Section 508 testing and ensure a thorough manual check of your website and other digital products. We provide you with an in-depth report of accessibility vulnerabilities to ensure that your website or product meets Section 508 compliance."
        },
        {
          "desc": "In addition, our testing team also helps you with a detailed VPAT creation. Based on your needs, we perform an audit to identify the accessibility issues and prioritize them. We help you improve the overall Section 508 compliance of your website or product and create a VPAT that discloses the state of accessibility."
        },
        {
          "desc": ""
        }
      ]
    },
    {
      "title": "W3C",

      "list2": [
        {
          "desc": "The World Wide Web Consortium (W3C) develops international standards for the Web: HTML, CSS, and many more."
        }
      ]
    },
    {
      "title": "WAI",

      "list2": [
        {
          "desc": "You can use W3C WAI resources to make your websites, applications, and other digital creations more accessible and usable to everyone."
        }
      ]
    },
    {
      "title": "ASSESSMENT",

      "list2": [
        {
          "desc": "The Section 508 testing team includes accessibility experts and people with disabilities who evaluate the existing state to refine your accessibility requirements. We provide you comprehensive report addressing the accessibility issues and the changes to be implemented which help you make your website or product meet Section 508 compliance."
        }
      ]
    },
    {
      "title": "REMEDIATION",

      "list2": [
        {
          "desc": "We extend technical assistance to your internal teams by guiding them in implementing accessibility in your websites or products. It provides the solution or assists your team in making sure of how to integrate accessibility to make your website or product Section 508 compliant."
        }
      ]
    },
    {
      "title": "MONITORING",

      "list2": [
        {
          "desc": "Our testing model helps you set up a team that will regularly monitor Section 508 compliance of websites or products that are subject to change. We can also set up a periodic monitoring dedicated team and provide you a detailed accessibility status report as the progress is made."
        }
      ]
    },
    {
      "title": "ASSISTIVE TECHNOLOGIES USED FOR WEB BROWSING",
      "list1": [
        {
          "desc": "Individuals living with a disability use assistive technologies such as the following to enable and assist web browsing:"
        },
        {
          "desc": "Screen reader software, which can read out, using synthesized speech, either selected elements of what is being displayed on the monitor (helpful for users with reading or learning difficulties), or can read out everything that is happening on the computer (used by blind and vision impaired users)."
        },
        {
          "desc": "Braille terminals, consisting of a refreshable braille display which renders text as braille characters (usually by means of raising pegs through holes in a flat surface) and either a mainstream keyboard or a braille keyboard."
        },
        {
          "desc": "Screen magnification software enlarges what is displayed on the computer monitor, making it easier to read for vision-impaired users."
        },
        {
          "desc": "Speech recognition software that can accept spoken commands to the computer, or turn dictation into grammatically correct text – useful for those who have difficulty using a mouse or a keyboard."
        },
        {
          "desc": "Keyboard overlays can make typing easier or more accurate for those who have motor control difficulties."
        },
        {
          "desc": "Access to subtitled or sign language videos for deaf people."
        }
      ]
    },

    {
      "title": "OVERLAP WITH OLDER USERS, MOBILE USERS, AND OTHER USER GROUPS",
      "list1": [
        {
          "desc": "Older users – Gaining a better understanding of the needs of older web users and how existing accessibility guidelines address those needs is one goal of the WAI-AGE Project, funded by the European Commission."
        },
        {
          "desc": "Mobile devices – There is significant overlap between designing for mobile devices and designing for accessibility. Understanding this overlap helps designers more efficiently meet both goals. People with low bandwidth connections or older technology, people with low literacy or not fluent in the language, and new users."
        }
      ],
      "list2": [
        {
          "desc": "WAI’s recent work explores in detail the relationship between designing for people with disabilities and designing for other “non-disabled” user populations who benefit from accessibility, such as:"
        }
      ]
    },
    {
      "title": "COMPREHENSIVE INTERNATIONAL STANDARDS",

      "list2": [
        {
          "desc": "These additional benefits are not always realized when designers use only limited standards. For example, current U.S. Section 508 web standards do not cover text resizing at all (and were published in 2000)."
        },
        {
          "desc": "WAI’s accessibility standards are developed through the W3C process, with the goal of meeting the needs of individuals, organizations, and governments internationally."
        },
        {
          "desc": "As many national governments update their accessibility policies and standards (including the U.S. Section 508 and 255), adopting WCAG 2.0 and WAI’s other accessibility standards provides international harmony."
        }
      ]
    },
    {
      "title": "Standards we follow under WCAG",

      "list2": [
        {
          "desc": "In 1999 the Web Accessibility Initiative, a project by the World Wide Web Consortium (W3C), published the Web Content Accessibility Guidelines WCAG 1.0."
        },
        {
          "desc": "On 11 December 2008, the WAI released the WCAG 2.0 as a Recommendation. WCAG 2.0 aims to be up-to-date and more technology-neutral. Though web designers can choose either standard to follow, the WCAG 2.0 has been widely accepted as the definitive guideline on how to create accessible websites. Governments are steadily adopting WCAG 2.0 as the accessibility standard for their own websites. In 2012, the Web Content Accessibility Guidelines were also published as an ISO/IEC standard: “ISO/IEC 40500:2012: Information technology – W3C Web Content Accessibility Guidelines (WCAG) 2.0”."
        }
      ]
    },

    {
      "title": "TEXT RESIZING EXAMPLE",

      "list2": [
        {
          "desc": "An example of how accessibility overlaps with other issues and the different components of web accessibility is resizing text in websites."
        },
        {
          "desc": "For years, common browsers have provided settings for text sizes. However, it only worked if website developers coded relative text sizes (for example, % or em) instead of absolute sizes (e.g., pt), and didn’t put text in images. Also, most browsers offered only five text sizes. That meant that many users were not able to increase the text size sufficiently or at all for most websites."
        },
        {
          "desc": "Now, many browsers provide zoom functionality. With zoom, users can change the text size (no matter how website developers code it) and images within a significant range, often 10-1000 percent. (Still many users aren’t aware of this functionality or are stuck using browsers without it.)"
        },
        {
          "desc": "Text resizing through zoom illustrates where accessibility can be provided through the browser. This is an example of the shared responsibility of web accessibility-what we call the “Essential Components of Web Accessibility.”"
        },
        {
          "desc": "WAI covers these components with guidelines for “user agents” (such as browsers and media players) and for authoring tools (such as WYSIWYG editors, content management systems [CMS], blog software, and social networking sites)."
        },
        {
          "desc": "Text resizing benefits others as well: older users often need to resize text, and when designing for mobile device users, the W3C Mobile Web Best Practices (MWBP) says, “Do not use pixel measures and do not use absolute units”"
        }
      ]
    },
    {
      "title": "Most answered to clients under WCAG Compliance",
      "list1": [
        {
          "desc": "Why it is important to your business, institution, or organization"
        },
        {
          "desc": "At what point is your website in its lifecycle?"
        },
        {
          "desc": "Whether build fresh or fix the current one?"
        },
        {
          "desc": "Who understands WCAG?"
        },
        {
          "desc": "What is a web accessibility statement guide?"
        },
        {
          "desc": "How frequently the website should be updated?"
        }
      ]
    }
  ]
}
